CSI API ETABS v1
cCaseResponseSpectrum.GetDirComb Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDirComb(
	string Name,
	ref int MyType,
	ref double SF
)
Function GetDirComb (
	Name As String,
	ByRef MyType As Integer,
	ByRef SF As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim MyType As Integer
Dim SF As Double
Dim returnValue As Integer
returnValue = instance.GetDirComb(Name,
	MyType, SF)
int GetDirComb(
	String^ Name,
	int% MyType,
	double% SF
)
abstract GetDirComb :
        Name : string *
        MyType : int byref *
        SF : float byref -> int
Parameters
Name
Type: System.String
MyType
Type: System.Int32
SF
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace